from typing import Literal

def knight(loc : str):
    """ 
    행복 왕국의 왕실 정원은 체스판과 같은 8 X 8 좌표 평면이다. 
    왕실 정원의 특정한 한 칸에 나이트가 서 있다. 
    나이트는 매우 충성스러운 신하로서 매일 무술을 연마한다.

    나이트는 말을 타고 있기 때문에 이동을 할 때는 L자 형태로만 이동할 수 있으며 정원 밖으로는 나 
    갈 수 없다. 나이트는 특정한 위치에서 다음과 같은 2가지 경우로 이동할 수 있다.
    1. 수평으로 두 칸 이동한 뒤에 수직으로 한 칸 이동하기
    2. 수직으로 두 칸 이동한 뒤에 수평으로 한 칸 이동하기

    입력 조건 • 첫째 줄에 8 x 8 좌표 평면상에서 현재 나이트가 
                위치한 곳의 좌표를 나타내는 두 문자로 구성된 문자열이 입력된다. 
                입력 문자는 31 처럼 열과 행으로 이뤄진다.
    출력 조건 • 첫째 줄에 나이트가 이동할 수 있는 경우의 수를 출력하시오
    예시 ) a1 -> 2
    """
    x = int(loc[1])
    y = ord(loc[0]) - ord('a') + 1
    # x 행 y 열 (1 <= x, y <= 8)
    count = 0
    diff = [(-2,-1), (-1,-2), (1,-2), (2,-1), (2,1), (1,2),(-1,2),(-2,1)]
    for (dx, dy) in diff:
        if isValid(x + dx, y + dy): count += 1

    return count

def isValid(x : int, y : int):
    return x >= 1 and y >= 1 and x <= 8 and y <= 8
    

if __name__ == "__main__":
    print(knight("a1"))














